<!--  -->
<template>
<div class="strategyContent">
  <div class="content" v-for="(item, index) in dataList" v-show="item.id==showItem" :key="index">
    <h2 class="tit">{{item.tit}}</h2>
    <div class="authorDis">
      <p><span>{{item.sj}}</span>{{item.author}}</p>
    </div>
    <p class="contentDis">{{item.contentDis}}</p>
    <img :src="item.imgUrl" alt="">
    <div class="content-item" v-for="(item, index) in item.contentList" :key="index">
      <h3 v-if="item.tit != '' ">{{index+1}}、{{item.tit}}</h3>
      <p>{{item.content}}</p>
    </div>
  </div>
  <div class="pageRouter content">
    <div class="pageArrow">
      <i class="el-icon-arrow-left"></i>
      <span>上一篇</span>
    </div>
    <div class="pageNext">
      <span>下一篇</span>
      <i class="el-icon-arrow-right"></i>
    </div>
  </div>
</div>
</template>

<script>
export default {
  data() {
    return {
      showItem: '',
      dataList: [{
          id: 'dz1',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '不同年龄选购衣柜有什么区别？',
          imgUrl: require('@/assets/img/strategy/img1.jpg'),
          contentDis: '衣柜是卧室必备家具之一，在一个家庭里面，有老人、有小孩，几乎每个人对待定做衣柜的需求都是不一样的，这就衍生出了定制衣柜有年龄阶段的说法.不同年龄阶层人群，因为生活习惯不同或者身体状况差异等因素，他们的衣柜设计也是有所差别的.那么衣柜设计的讲究在哪里?不同年龄层衣柜该怎么设计呢?',
          contentList: [{
              tit: '儿童衣柜',
              content: '儿童正处生长阶段，衣服更换快、玩具越堆越多，所以童用衣柜要有强大的收纳和多功能的分区，儿童叠放衣物较少，但孩子成长迅速，所以设计时要把未来5-10年的使用习惯和身高变化等因素考虑进去，叠放区与挂放区的比例要适当搭配,这样才能满足孩子的收纳需求。'
            },
            {
              tit: '成年人衣柜',
              content: '女性可在衣柜设置饰品柜，适当增加层板;男性可增设西裤架、适当增多挂衣区;小夫妻则可将衣柜内部空间按照5:5或者6:4的比例划分设计，双方各占一边。内部设计主要依照两个人的穿衣、使用习惯来确定。内衣、领带和袜子可用专用的小格子，既有利于衣物保养，取物也更直观方便；毛衣可放在较深的抽屉里；裤子则悬挂在挂架区，也省去了熨烫的时间，注意要分男女，这样在寻找的时候也很方便。柜体内的挂衣架通常分为长短两层分别储存大衣和上装，衬衫也可以放置于独立的小抽屉或搁板，不会因过多衣物挤压在一起而皱折难看。'
            },
            {
              tit: '老年人衣柜',
              content: '老年父母叠放衣物较多，通常挂件较少，因此在设计衣柜时可以考虑多做些衣柜层板和衣柜抽屉，而老年人因身体状况，应该在离地面1米高左右，长辈总会有些念旧情结，所以纪念性物品会较多，建议在设计衣柜时要考虑长辈房衣柜的收纳容量。'
            }
          ]
        },
        {
          id: 'dz2',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '定制橱柜保养的方法及攻略',
          imgUrl: require('@/assets/img/strategy/img2.jpg'),
          contentDis: '民以食为天，定制橱柜对于厨房的重要性就如同人脸对于人一样，在厨房当中占据着重要地位。而我们在使用定制橱柜的时候，要想让它更加经久耐用，应当注意正确的使用和保养。下面就让小编给大家介绍定制橱柜保养的方法及攻略。',
          contentList: [{
              tit: '',
              content: '1、定制橱柜的门板应避免台面上的水流下来从而浸泡到门板，时间长会产生变形现象；门板表面要防止利器划伤，损坏其表面颜值，擦拭时可用清洁剂和肥皂液处理，不宜使用稀料和酒精。'
            },
            {
              tit: '',
              content: '2、定制橱柜的台面在操作的过程中，应尽量避免使用尖锐的物品触击台面，以免产生划痕现象。无论选择哪种台面，都应该在砧板上切菜；需要避免热锅、热水壶直接与橱柜台面接触，最好能够置于锅架上。'
            },
            {
              tit: '',
              content: '3、定制橱柜的柜体应当注意上柜的承载力一般不如下柜，所以上柜适合放轻巧的物品，重的物品适合放在下柜。放入柜中的器皿应该清洗干净后再放入，要注意擦拭干器皿中的水。'
            },
            {
              tit: '',
              content: '4、定制橱柜中的五金件遇到水也需要擦干，避免长时间停留在表面造成水痕现象；水槽需要设计过滤器兜住内部滤盒，防止菜屑及细小残渣冲入水管，上时间积少成多，则会堵住水管。'
            },
            {
              tit: '',
              content: '5、如果在生活中遇到胶质或比较黏的东西，可以用保养清洁蜡或少量酒精（带有油漆的门板不能使用酒精）轻轻擦拭，切记使用钢丝球。'
            },
            {
              tit: '',
              content: '以上就是关于定制橱柜保养的方法及攻略，只有不定期的进行保养和维护，定制橱柜才会使用的更加长久些，你学到了吗？'
            }
          ]
        },
        {
          id: 'dz3',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '定制家具应该如何做清洁工作？',
          imgUrl: require('@/assets/img/strategy/img3.jpg'),
          contentDis: '一个温暖的家肯定是干净整洁才会舒适，所以高质量的家居生活离不开做家务，对于定制家具的清洁工作是很让人头疼的。很多人又担心家具受潮或清洁不到位，因为对定制家具不够了解，在清洁定制家具时，总会出现很多问题。今天小编就来介绍一下定制家具的清洁工作。',
          contentList: [{
              tit: '茶水清洁',
              content: '前一天泡的、没喝完的茶水也是可以用在家具清洁上，用湿纱布包裹茶叶渣去擦，或用冷茶水擦洗，会让油漆过沾染了灰尘的家具更加光洁明亮。'
            },
            {
              tit: '蛋清擦拭',
              content: '蛋清可是可以用来清洁家具的，尤其是针对皮质沙发等，用一块干净的绒布蘸些蛋清擦拭弄脏了的真皮沙发，既可去除污迹，又能使沙发皮面光亮如初。'
            },
            {
              tit: '酒精清洁',
              content: '毛绒沙发可以说是比较难清洁的家具了，但可以用酒精来解决，毛绒布料的沙发可用毛刷蘸少许稀释的酒精扫刷一遍，再用电吹风吹干，会有很好的清洁效果，还能杀菌消毒。'
            },
            {
              tit: '食盐清洁',
              content: '有小孩的家庭，地毯上常常滴有汤汁，这很困恼，但千万不能用湿布去擦，可以先用洁净的干布或手巾吸干水分，然后在污渍处撒些食盐，待盐面渗入吸收后，用吸尘器将盐吸走，再用刷子整平地毯就可以了。'
            },
            {
              tit: '牙膏清洁',
              content: '家里的冰箱开开合合，手脏的时候很容易留下手印，牙膏中含有研磨剂，去污力非常强，可以用牙膏来清洁冰箱外壳上面的污垢，用软布蘸少许牙膏慢慢擦拭，如果污迹较顽固，可多挤一些牙膏再用布反复擦拭冰箱即会恢复光洁了。'
            },
            {
              tit: '',
              content: '在生活中我们用到的全屋定制家具是很多的，并且带给我们的使用效果也很好，要想家具使用的时间更长，经常维护、保养是肯定离不开的。如果还有什么不懂的问题欢迎留言，希望对大家有帮助。'
            }
          ]
        },
        {
          id: 'dz4',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '家居装修，如何去除甲醛君？',
          imgUrl: require('@/assets/img/strategy/img4.jpg'),
          contentDis: '人生当中购买一套属于自己的房子是一件很不容易的事情，刚刚装修完，恨不得马上入住，这种做法是不对的。刚装修完的新房，总是有甲醛气体在房子里挥之不去，严重影响居住者的身心健康。那么家居装修，如何去除甲醛君？跟随璞缇小编一起来学习下。',
          contentList: [{
              tit: '',
              content: '1、炎热夏季的到来，可以使用活性炭进行吸附来去除有害气体，注意在使用活性炭的过程中要不定期更换新的。否则，长时间使用的活性炭不但起不到净化空气的效果，还会释放有害气体。'
            },
            {
              tit: '',
              content: '2、想要快速去除甲醛的方法就是勤开窗户，炎热的夏季会加快甲醛气体的挥发。最佳开窗户时间就是在早上和晚上，应该尽量避开阳光充足的正午，避免墙面、定制家具的暴晒而导致开裂现象。'
            },
            {
              tit: '',
              content: '3、最简单不过的一种方法就是清水吸附，可以在房子内摆上几盆清水，不过过程有点麻烦，就是需要每天换两三次。但是比起经济实惠，这点麻烦也不为过。'
            },
            {
              tit: '',
              content: '4、绿色、环保型的家居装修，第一时间想到的肯定是绿色植物，能够吸收甲醛气体的有芦荟、吊兰、虎尾兰、龟背竹等。简直是家居中吸收甲醛的小能手，还能起到美观的作用。'
            },
            {
              tit: '',
              content: '人人都想要拥有一个环保、舒适的家居环境，从身边出发，从生活的点点滴滴出发。关于家居装修，如何去除甲醛？璞缇家居小编就给大家介绍到这里了，希望对大家有所帮助。'
            }
          ]
        },
        {
          id: 'dz5',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '家装光线差该如何解决？',
          imgUrl: require('@/assets/img/strategy/img5.jpg'),
          contentDis: '房子的光线是每个人都会比较关心的生活方面，毕竟房间是我们基本上天天都在使用或者享受的一个私人小空间，它的光线以及舒适程度直接会影响我们的生活心情，房屋南北不通透、格局狭长、光线不足等问题都会导致房屋采光不好，昏暗压抑，有什么办法可以改善这个问题呢？',
          contentList: [{
              tit: '选择大面积白色为主调的装修',
              content: '如果你家采光不好，请抛弃等容易走深色路线的风格如美式、中式风格，尽量选择简约风格装修吧，可以用白色拯救黑屋子，墙面、天花板、家具均可使用白色。当然，除白色还可以选择一些浅蓝色、浅粉等浅色系也是可以的。不过还是白色相对来说使用起来安全许多，也很好搭配。'
            },
            {
              tit: '引入镜面装饰',
              content: '用镜子来增加空间感和反射光线也是很常见的一种手法。除此之外，很多人家里喜欢摆放的照片墙其实也是一种微妙的镜面装饰，同样带有反射光线。可以选择一些有设计感的镜子，像画一样裱框挂在墙上。当“暗间”无法从外界获取采光的时候，也可以考虑一下安装一个室内窗，向房子的内部借光。'
            },
            {
              tit: '营造穿透空间',
              content: '采光不足是硬伤，最简单粗暴又有效的方法就是户型改造，可以将一些非承重墙打掉，将面积重新优化组合，组合使用玻璃隔断，或者镂空隔断，这样不仅让空间被合理的分隔出来，有不会把光挡住，大量的运用落地窗，将自然光线引入室内，落地窗不仅能给人视觉上通透的感觉，也会让家变得惬意、休闲。'
            },
            {
              tit: '空间留白、减少家具',
              content: '采光不足的房子，吊顶尽量简单，或者干脆不做吊顶。如果很喜欢吊顶的话，推荐较小、较薄的吊顶设计。家具尽量不要选择较高而厚重的，家具低矮、数量少了，空间也就宽敞了。'
            }
          ]
        },
        {
          id: 'dz6',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '梅雨季节的到来，定制家具如何做好防范工作？',
          imgUrl: require('@/assets/img/strategy/img6.jpg'),
          contentDis: '定制家具作为整个家居空间的设计，不仅可以满足不同年龄段消费者的需求，还个性时尚。前方高能预警，在梅雨季节的到来之际，定制家具的保养就成了“头号大敌”，那么定制家具如何做好防范工作？',
          contentList: [{
              tit: '',
              content: '1、定制家具如果表面有灰尘时，应使用毛掸或软布除尘，如果表面有污渍时，应使用砂蜡擦磨清除。如果定制家具表面有轻微划痕和碰伤的情况，可用布蘸烟灰与柠檬汁混合物来进行涂擦，干后上蜡就可以了。'
            },
            {
              tit: '',
              content: '2、梅雨季节的空气是潮湿的，在早上和晚上是空气湿度最高的时候，我们应当要注意门窗的开关时间，避免湿气过重渗入家中，从而导致家具出现潮湿发霉的症状。'
            },
            {
              tit: '',
              content: '3、如今社会的发展速度之快，在面对家居潮湿的问题，可以采用除湿器、空调等电器，来吸取空气中的潮湿水分。这样可以把整个家居中的潮湿含量降到最低，避免家具在潮湿的空气中发霉发潮。'
            },
            {
              tit: '',
              content: '4、在家居空间中，定制家具起到很关键的作用，若是定制家具没有做好防潮工作，就会出现家具膨胀的现象。此时可以在家具底下装上防水垫，并做好通风效果的处理。'
            },
            {
              tit: '',
              content: '5、可以在定制家具的底部铺上报纸或内侧铺上也行，这样能够把家具中的湿气给吸收，从而达到最好的防霉效果。'
            }
          ]
        },
        {
          id: 'dz7',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '衣柜发霉如何处理？',
          imgUrl: require('@/assets/img/strategy/img7.jpg'),
          contentDis: '随着社会的开展，科技的一日千里，消费者越来越注重生活品味的进步，家具在考究适用的根底上，其艺术价值和审美功用也日益凸显出来。作为整体家具的一个晋级版，全屋定制个性突出，在设计的过程中考究和消费者的深度沟通，能充沛的分离消费者的生活习气和审美规范。梅雨季里空气湿度大、气温高，家里的衣物、家具等都容易发霉，就连衣柜里的衣物都感觉黏糊糊的。衣柜发霉不仅会使板材受损，霉菌还会在室内空气中传播，影响家人们的健康。衣柜发霉要如何处理如何呢?',
          contentList: [{
              tit: '及时清洁',
              content: '发现衣柜发霉时务必要及时清洁，用干的纸巾和刷子擦干净，再用湿布擦拭。清理完霉菌后，要用吹风机将发霉处吹干，然后再将衣柜内的衣物拿出来清洗晾晒。除此之外，我们还可以在发霉处刷一遍清漆，这样就能够有效地防止再长霉了。'
            },
            {
              tit: '保持干燥（干茶叶）',
              content: '将干茶叶装入纱布袋，分散在各处，不仅能去除霉味，还能让衣物散发阵阵清香。'
            },
            {
              tit: '保持干燥（点蜡烛）',
              content: '点蜡烛能降低空气中的湿度、清除异味，这个方法估计是很多人都没有注意到的，如果家里的空气比较湿，可以点上一两个蜡烛，最好选择选择带有香精的香薰蜡烛，不仅能去室内的潮湿，还能清除异味，让室内散发香气，这对衣柜及衣柜里面的衣物防止受潮发霉也是比较有好处的。不过点燃蜡烛期间人不能离开哦，要注意安全！'
            },
            {
              tit: '保持干燥（打蜡或活性炭）',
              content: '衣柜防潮可以定期为衣柜打蜡，建议半年打一次蜡，不仅可以保持衣柜光鲜亮丽，还可以防霉防潮。衣柜防潮可利用废弃的小棉袜装上小木炭或活性碳，扎紧袋口，也可利用滤水器卸下之滤芯，放入衣柜中防潮，达到天然除湿剂的效果。'
            }
          ]
        },
        {
          id: 'dz8',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '不同年龄选购衣柜有什么区别？',
          imgUrl: require('@/assets/img/strategy/img8.jpg'),
          contentDis: '整理收纳成为一种“文化”，应该算是消费社会的衍生品之一。当对物质的欲望随时随地被勾起，又随时随地被满足，不知不觉间，人们的生活开始被物品所困，多余的杂物表面上占据了我们的生活空间，其实还占据了我们心灵的内存。“衣物渐入迷人眼，乱得不能再乱”整理就成了令人头疼的问题。有人想到了定制衣柜，那么定制衣柜好吗？',
          contentList: [{
              tit: '将所有衣服分类',
              content: '把衣服的品类进行细分：短袖（有领、无领、有花、无花）、长袖、短裤、长裤、短裙、长裙、连衣裙等等，分细一点，分类细致是为了后续再找衣服上，能够快速找到，同时也是为了第二步。'
            },
            {
              tit: '规划衣柜区域',
              content: '衣柜里能挂衣服的算一个区域，叠衣服的地方一个区域，放内衣内裤的一个区域，也同样是将衣柜空间细分，然后把衣服放进去，比如挂衣服都是长袖衬衫衣服，那后续使用衣服就按照从哪里拿，就放回哪里去。'
            },
            {
              tit: '巧用收纳用品',
              content: '可以购买统一的衣架，衣架参差不齐，容易影响视觉和使用率。抽屉不够用的时候，还可以购买一些抽屉盒，用来放置内衣、内裤、围巾、袜子等。最后再用百纳箱，这个季节的衣服拿出来穿，不是这个季节的衣服全部放进百纳箱里，换季的时候，再按照这种方式更换一下。'
            },
            {
              tit: '',
              content: '拓展储藏空间，拯救乱糟糟。衣服随用随取，再也不用和收纳盒作斗争了。避免衣物发霉，落灰，给心爱的衣裳们一个干净的家，也能让你时刻美美哒！'
            }
          ]
        },
        {
          id: 'dz9',
          author: 'PROTI 璞缇',
          sj: '2019-8-15',
          tit: '远离噪音烦恼，家居防噪技巧有哪些？',
          imgUrl: require('@/assets/img/strategy/img9.jpg'),
          contentDis: '生活在繁华的大都市，家是一个温暖的港湾，拖着疲惫的身体回到家中，想要好好的休息一番。可是却面临着许多噪音，如：鸣笛声、叫喊声、汽车声等，让我们无法很快入睡。因此在家居设计中，家居防噪技巧有哪些？',
          contentList: [{
              tit: '墙面设计',
              content: '在家居装修时，建议在墙面中间添加隔音材料，还可以设计粗糙的墙面。因为光滑的墙面可以增加声贝的传播速度，对隔音也是能起到一定作用的。'
            },
            {
              tit: '木门设计',
              content: '木门的效果也是很强大的，门的内芯填充物能够起到很好的隔音作用，密度越高、有足够大的厚度，起到的隔音效果也是最好的。'
            },
            {
              tit: '窗户设计',
              content: '家居中绝大多数的声音都是从窗户中传进来的，可以选择双层窗户的结构。再辅以皮料包裹吸音棉材质的隔音条，降噪效果更佳。'
            },
            {
              tit: '地板设计',
              content: '软木地板是由黄柏与橡树的树皮制成，其细胞结构类似蜂窝状，具备很多密闭的气囊，具有超强的吸音与防震功能，可有效降低人们走动时制造的噪音。地板在定制家具中的作用是蛮大的，不仅能起到美观作用，还能隔音。'
            },
            {
              tit: '柔和光线',
              content: '过于艳丽的地板、墙壁会干扰人们的中枢神经系统，产生心情烦躁，对噪音也是十分敏感，这样很容易产生焦虑心理。 '
            }
          ]
        }
      ]
    }
  },

  components: {},

  computed: {},

  methods: {},

  created() {
    var id = this.$route.query.strategy;
    this.showItem = id;
    console.log(this.showItem);
  },
}
</script>

<style lang="scss" scoped>
P {
  color: #333;
  text-indent: 2em;
}

h3 {
  color: #333;
}

.strategyContent {
  background: #fff;
  padding: 0 0 88px 0;

  .content {
    margin: 0 auto 0;

    h2 {
      text-align: center;
      padding: 48px 0 0 0;
    }

    .authorDis {
      p {
        padding: 12px 0;
        font-size: 14px;
        text-align: center;
        color: #666;

        span {
          margin: 0 24px 0 0;
        }
      }
    }

    img {
      display: block;
      margin: 0 auto 22px;
    }

    .contentDis {
      margin: 24px 0 12px 0;
      line-height: 1.6;
    }

    .content-item {
      h3 {
        margin: 24px 0 12px 0;
      }

      p {
        line-height: 2;
      }
    }
  }

  .pageRouter {
    margin: 48px auto 0;

    .pageArrow {
      float: left;
    }

    .pageNext {
      float: right;
    }

    span {
      font-size: 14px;
      color: #333;
      transition: all .2s ease-in;
    }

    span:hover {
      color: #0c9de0;
      cursor: pointer;
    }
  }
}
</style>
